[
  {
    "title": "About me",
    "paragraph" : "My focus is to develop as Software Developer. I believe that the qualities I have – diligence, analytical mind, fast learning capability and goal - orientation are the foundation of this; I have had the opportunity to be part of a microservice architecture project that consisted of about 30 people – mutual understanding, the awareness that everyone is fighting for a common goal as well as clear communication were the key to success.",
    "secondParagraph": "I agree with Thomas Jefferson who said - \" I find that the harder I work , the more luck I seem to have.\""
  },
  {
    "title": "Technical skills",
    "skills": [
    "JavaScript - essential knowledge to go any further with programming",
    "Vue - proficient (based on Pluralsight)",
    "Angular - proficient (based on Pluralsight)",
    "TypeScript - funtamental for work with Angular",
    "Firebase Cloud Services - DB, Auth, Hosting",
    "HTML5 - attention to semantic code and good practice",
    "CSS3 - attention to good design and clean code",
    "SASS - fundamental for writing clean nested selectors",
    "Bootstrap - pracitce use and quick reseach",
    "Responsive Web Design",
    "TestCafe - first test automation framework I got to work with. In my current employement I was responsible for creation of automated tests, API test automation",
    "JAVA - I got to learn Java to create automation tests in Selenium Webdriver framework. It helped me a lot to become a better developer",
    "Selenium WebDriver - creation of more complex automation tests",
    "GIT",
    "JIRA"
  ]
  },
  {
  "title": "Experience",
  "experience":[
      {
      "jobTitle": "Junior Software Engineer",
      "location": "Global Logic, Zielona Góra, Poland",
      "dateRange": "(09/2019 – present)"
      },
      {
      "jobTitle": "The winner of Summer Front – End Academy",
      "location": "Global Logic, Zielona Góra, Poland",
      "dateRange": "(07/2019 – 09/2019)"
      },
      {
      "jobTitle": "Administrator / IT Support",
      "location": "Manchester, United Kingdom",
      "dateRange": "(03/2017 – 03/2019)"
      }
    ]
  }
]
